feat: Documentation, Docker, LICENSE
### API REFERENCE
- Updated API Reference markdown to reflect new api responses, requests and JWT fields

### docs/HEXALGON_ARTICLE.md
- Updated the article to illustrate the systems' limitations and planned work around it

### README.md
- Updated to reflect the current folder structure
- Updated the versioning and Roadmap

### Docker
- Updated some env variables in docker-compose yaml

### LICENSE
- Added Apache 2.0 License

### Env
- Added .env.example for easy setup
